create_clock -name clk -period 2 -waveform {0 1}  [get_ports clk]

create_clock -name VCLK -period 2 -waveform {0 1}

set_input_delay 0.5 -clock VCLK [[remove_from_collection [all_inputs] [get_ports clk]]]

set_output_delay 0.5 -clock VCLK [all_outputs]

# set_input_delay 0.1 -clock clk [all_inputs]

# set_output_delay 0.1 -clock clk [all_output]

set_clock_uncertainty -setup 0.25 [get_clocks clk]
set_clock_uncertainty -hold 0 [get_clocks clk]